<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/9c501937-f14a-4847-9094-0ac90684515d/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs.aws_ecs_task_definition.app_task_definition has been deleted
  - resource "aws_ecs_task_definition" "app_task_definition" {
      - arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-history:4" -> null
        id                       = "prod-history"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0e4c3e984dd851e98"
      ~ tags                 = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] has changed
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-013632d6acdc19f3c"
      ~ tags                 = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-009d6aead2afe5310"
      ~ tags             = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-018f623a7e829f2b4"
      ~ tags             = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-05cf1c203c88fa386"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0b32e43f9f425feec"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-09226556fd9b1b1a4"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01ebbeab3a2cb9086"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-062389591aadc0473"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-030e5c8360518bf8b"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_kms_alias.analytics_bucket will be created
  + resource "aws_kms_alias" "analytics_bucket" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/docdb/walletconnect-prod-history"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.docdb_encryption will be created
  + resource "aws_kms_key" "docdb_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "walletconnect-prod-history"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Name"      = "walletconnect-prod-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "prod"
        }
    }

  # aws_prometheus_workspace.prometheus will be updated in-place
  ~ resource "aws_prometheus_workspace" "prometheus" {
        id                  = "ws-29641597-9b6a-44dd-9f05-e48a94e51f9c"
      ~ tags                = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all            = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place
  ~ resource "aws_acm_certificate" "domain_certificate" {
        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/5030302f-c887-4743-909b-76e57f844a3c"
      ~ tags                      = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                  = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {
        id                = "prod-history_logs"
        name              = "prod-history_logs"
      ~ tags              = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all          = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "app_cluster" {
        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/prod-history"
        name               = "prod-history"
      ~ tags               = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-history/prod-history-service"
        name                               = "prod-history-service"
      ~ tags                               = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-history:5" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition will be created
  + resource "aws_ecs_task_definition" "app_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 384
                  + dependsOn        = [
                      + {
                          + condition     = "START"
                          + containerName = "aws-otel-collector"
                        },
                    ]
                  + environment      = [
                      + {
                          + name  = "LOG_LEVEL"
                          + value = "INFO"
                        },
                      + {
                          + name  = "PORT"
                          + value = "8080"
                        },
                      + {
                          + name  = "TELEMETRY_ENABLED"
                          + value = "true"
                        },
                      + {
                          + name  = "TELEMETRY_GRPC_URL"
                          + value = "http://localhost:4317"
                        },
                      + {
                          + name  = "TELEMETRY_PROMETHEUS_PORT"
                          + value = "8081"
                        },
                    ]
                  + essential        = true
                  + image            = "898587786287.dkr.ecr.eu-central-1.amazonaws.com/gilgamesh:0.5.0"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "prod-history_logs"
                          + awslogs-region        = "eu-central-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 896
                  + name             = "prod-history"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                      + {
                          + containerPort = 8081
                          + hostPort      = 8081
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 524288
                          + name      = "nofile"
                          + softLimit = 262144
                        },
                    ]
                },
              + {
                  + command          = [
                      + "--config=/etc/ecs/ecs-amp-xray-prometheus.yaml",
                    ]
                  + cpu              = 128
                  + environment      = [
                      + {
                          + name  = "AWS_PROMETHEUS_ENDPOINT"
                          + value = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/api/v1/remote_write"
                        },
                      + {
                          + name  = "AWS_PROMETHEUS_SCRAPING_ENDPOINT"
                          + value = "0.0.0.0:8081"
                        },
                      + {
                          + name  = "AWS_REGION"
                          + value = "eu-central-1"
                        },
                    ]
                  + essential        = true
                  + image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "True"
                          + awslogs-group         = "/ecs/prod-history-ecs-aws-otel-sidecar-collector"
                          + awslogs-region        = "eu-central-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 128
                  + name             = "aws-otel-collector"
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::898587786287:role/prod-history-ecs-task-execution-role"
      + family                   = "prod-history"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Name"      = "walletconnect-prod-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "prod"
        }
      + task_role_arn            = "arn:aws:iam::898587786287:role/prod-history-ecs-task-execution-role"

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.aws_iam_policy.otel will be updated in-place
  ~ resource "aws_iam_policy" "otel" {
        id        = "arn:aws:iam::898587786287:policy/prod-history-otel"
        name      = "prod-history-otel"
      ~ tags      = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all  = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "prod-history-ecs-task-execution-role"
        name                  = "prod-history-ecs-task-execution-role"
      ~ tags                  = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all              = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.aws_lb.application_load_balancer will be updated in-place
  ~ resource "aws_lb" "application_load_balancer" {
        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/prod-history-load-balancer/28b76ad29a3fee28"
        name                             = "prod-history-load-balancer"
      ~ tags                             = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                         = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_listener.listener will be updated in-place
  ~ resource "aws_lb_listener" "listener" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/701716f63ad30744"
      ~ tags              = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all          = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_listener.listener-http will be updated in-place
  ~ resource "aws_lb_listener" "listener-http" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/a48db675784c3024"
      ~ tags              = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all          = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_target_group.target_group will be updated in-place
  ~ resource "aws_lb_target_group" "target_group" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-history-target-group/0fe353425cec2903"
        name                               = "prod-history-target-group"
      ~ tags                               = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_security_group.app_ingress will be updated in-place
  ~ resource "aws_security_group" "app_ingress" {
        id                     = "sg-02e638a4cfdf08176"
        name                   = "prod-history-ingress-to-app"
      ~ tags                   = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all               = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_ingress will be updated in-place
  ~ resource "aws_security_group" "lb_ingress" {
        id                     = "sg-0e0eb53e20c292a5f"
        name                   = "prod-history-lb-ingress"
      ~ tags                   = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all               = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-prod-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
        }
        # (7 unchanged attributes hidden)
    }

  # module.o11y.grafana_data_source.cloudwatch will be updated in-place
  ~ resource "grafana_data_source" "cloudwatch" {
        id                 = "81"
      ~ json_data_encoded  = jsonencode(
          ~ {
              - manageAlerts  = false -> null
              - sigV4Auth     = false -> null
              - timescaledb   = false -> null
              - xpack         = false -> null
                # (1 unchanged element hidden)
            }
        )
        name               = "prod-history-cloudwatch"
        # (5 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - default_region                = "eu-central-1" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = false -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.o11y.grafana_data_source.prometheus will be updated in-place
  ~ resource "grafana_data_source" "prometheus" {
        id                 = "82"
      ~ json_data_encoded  = jsonencode(
          ~ {
              ~ sigV4AuthType = "workspace-iam-role" -> "ec2_iam_role"
              - timescaledb   = false -> null
              - xpack         = false -> null
                # (4 unchanged elements hidden)
            }
        )
        name               = "prod-history-amp"
        # (6 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - http_method                   = "GET" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = true -> null
          - sigv4_auth_type               = "workspace-iam-role" -> null
          - sigv4_region                  = "eu-central-1" -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0e4c3e984dd851e98"
      ~ tags                 = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-092684c3f9ff22731"
      ~ tags     = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-013632d6acdc19f3c"
      ~ tags                 = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-009d6aead2afe5310"
      ~ tags             = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-018f623a7e829f2b4"
      ~ tags             = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-05cf1c203c88fa386"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0b32e43f9f425feec"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-09226556fd9b1b1a4"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01ebbeab3a2cb9086"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-062389591aadc0473"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-030e5c8360518bf8b"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-02b02d7ebf64d7699"
      ~ tags                                 = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all                             = {
          - "Application"      = "history" -> null
          - "Env"              = "prod" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "prod"
            # (1 unchanged element hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 3 to add, 27 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition has been deleted%0A  - resource "aws_ecs_task_definition" "app_task_definition" {%0A      - arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-history:4" -> null%0A        id                       = "prod-history"%0A        # (11 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] has changed%0A  ~ resource "aws_eip" "nat" {%0A        id                   = "eipalloc-0e4c3e984dd851e98"%0A      ~ tags                 = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A        # (12 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] has changed%0A  ~ resource "aws_nat_gateway" "this" {%0A        id                   = "nat-013632d6acdc19f3c"%0A      ~ tags                 = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] has changed%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-009d6aead2afe5310"%0A      ~ tags             = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] has changed%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-018f623a7e829f2b4"%0A      ~ tags             = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-05cf1c203c88fa386"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0b32e43f9f425feec"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[2] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-09226556fd9b1b1a4"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-01ebbeab3a2cb9086"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-062389591aadc0473"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[2] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-030e5c8360518bf8b"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_kms_alias.analytics_bucket will be created%0A  + resource "aws_kms_alias" "analytics_bucket" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + name           = "alias/docdb/walletconnect-prod-history"%0A      + name_prefix    = (known after apply)%0A      + target_key_arn = (known after apply)%0A      + target_key_id  = (known after apply)%0A    }%0A%0A  # aws_kms_key.docdb_encryption will be created%0A  + resource "aws_kms_key" "docdb_encryption" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + deletion_window_in_days            = 10%0A      + description                        = "walletconnect-prod-history"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = (known after apply)%0A      + tags_all                           = {%0A          + "Name"      = "walletconnect-prod-history"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "prod"%0A        }%0A    }%0A%0A  # aws_prometheus_workspace.prometheus will be updated in-place%0A  ~ resource "aws_prometheus_workspace" "prometheus" {%0A        id                  = "ws-29641597-9b6a-44dd-9f05-e48a94e51f9c"%0A      ~ tags                = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all            = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place%0A  ~ resource "aws_acm_certificate" "domain_certificate" {%0A        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/5030302f-c887-4743-909b-76e57f844a3c"%0A      ~ tags                      = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all                  = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place%0A  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {%0A        id                = "prod-history_logs"%0A        name              = "prod-history_logs"%0A      ~ tags              = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all          = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place%0A  ~ resource "aws_ecs_cluster" "app_cluster" {%0A        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/prod-history"%0A        name               = "prod-history"%0A      ~ tags               = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all           = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (2 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-history/prod-history-service"%0A        name                               = "prod-history-service"%0A      ~ tags                               = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all                           = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-history:5" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition will be created%0A  + resource "aws_ecs_task_definition" "app_task_definition" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + cpu              = 384%0A                  + dependsOn        = [%0A                      + {%0A                          + condition     = "START"%0A                          + containerName = "aws-otel-collector"%0A                        },%0A                    ]%0A                  + environment      = [%0A                      + {%0A                          + name  = "LOG_LEVEL"%0A                          + value = "INFO"%0A                        },%0A                      + {%0A                          + name  = "PORT"%0A                          + value = "8080"%0A                        },%0A                      + {%0A                          + name  = "TELEMETRY_ENABLED"%0A                          + value = "true"%0A                        },%0A                      + {%0A                          + name  = "TELEMETRY_GRPC_URL"%0A                          + value = "http://localhost:4317"%0A                        },%0A                      + {%0A                          + name  = "TELEMETRY_PROMETHEUS_PORT"%0A                          + value = "8081"%0A                        },%0A                    ]%0A                  + essential        = true%0A                  + image            = "898587786287.dkr.ecr.eu-central-1.amazonaws.com/gilgamesh:0.5.0"%0A                  + logConfiguration = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-group         = "prod-history_logs"%0A                          + awslogs-region        = "eu-central-1"%0A                          + awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  + memory           = 896%0A                  + name             = "prod-history"%0A                  + portMappings     = [%0A                      + {%0A                          + containerPort = 8080%0A                          + hostPort      = 8080%0A                        },%0A                      + {%0A                          + containerPort = 8081%0A                          + hostPort      = 8081%0A                        },%0A                    ]%0A                  + ulimits          = [%0A                      + {%0A                          + hardLimit = 524288%0A                          + name      = "nofile"%0A                          + softLimit = 262144%0A                        },%0A                    ]%0A                },%0A              + {%0A                  + command          = [%0A                      + "--config=/etc/ecs/ecs-amp-xray-prometheus.yaml",%0A                    ]%0A                  + cpu              = 128%0A                  + environment      = [%0A                      + {%0A                          + name  = "AWS_PROMETHEUS_ENDPOINT"%0A                          + value = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/api/v1/remote_write"%0A                        },%0A                      + {%0A                          + name  = "AWS_PROMETHEUS_SCRAPING_ENDPOINT"%0A                          + value = "0.0.0.0:8081"%0A                        },%0A                      + {%0A                          + name  = "AWS_REGION"%0A                          + value = "eu-central-1"%0A                        },%0A                    ]%0A                  + essential        = true%0A                  + image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"%0A                  + logConfiguration = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-create-group  = "True"%0A                          + awslogs-group         = "/ecs/prod-history-ecs-aws-otel-sidecar-collector"%0A                          + awslogs-region        = "eu-central-1"%0A                          + awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  + memory           = 128%0A                  + name             = "aws-otel-collector"%0A                },%0A            ]%0A        )%0A      + cpu                      = "512"%0A      + execution_role_arn       = "arn:aws:iam::898587786287:role/prod-history-ecs-task-execution-role"%0A      + family                   = "prod-history"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = {%0A          + "Name"      = "walletconnect-prod-history"%0A          + "Namespace" = "walletconnect"%0A          + "Stage"     = "prod"%0A        }%0A      + task_role_arn            = "arn:aws:iam::898587786287:role/prod-history-ecs-task-execution-role"%0A%0A      + runtime_platform {%0A          + operating_system_family = "LINUX"%0A        }%0A    }%0A%0A  # module.ecs.aws_iam_policy.otel will be updated in-place%0A  ~ resource "aws_iam_policy" "otel" {%0A        id        = "arn:aws:iam::898587786287:policy/prod-history-otel"%0A        name      = "prod-history-otel"%0A      ~ tags      = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all  = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place%0A  ~ resource "aws_iam_role" "ecs_task_execution_role" {%0A        id                    = "prod-history-ecs-task-execution-role"%0A        name                  = "prod-history-ecs-task-execution-role"%0A      ~ tags                  = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all              = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_lb.application_load_balancer will be updated in-place%0A  ~ resource "aws_lb" "application_load_balancer" {%0A        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/prod-history-load-balancer/28b76ad29a3fee28"%0A        name                             = "prod-history-load-balancer"%0A      ~ tags                             = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all                         = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (18 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_lb_listener.listener will be updated in-place%0A  ~ resource "aws_lb_listener" "listener" {%0A        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/701716f63ad30744"%0A      ~ tags              = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all          = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_lb_listener.listener-http will be updated in-place%0A  ~ resource "aws_lb_listener" "listener-http" {%0A        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/prod-history-load-balancer/28b76ad29a3fee28/a48db675784c3024"%0A      ~ tags              = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all          = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "prod" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-prod-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "prod"%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group will be updated in-place%0A  ~ resource "aws_lb_target_group" "target_group" {%0A        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/prod-history-target-group/0fe353425cec2903"%0A        name
...

```

</details>

*Action: `pull_request`*